[
  {
    "title": "Global brands",
    "description": "From federal companies to global brands. Visa, Delta, Amway, Mondelez, RaceTrac, and many more across my career.",
    "media": [
      "/assets/images/visa-cover-2.gif",
      "/assets/images/CleanShot 2026-01-22 at 19.22.59@2x.png"
    ],
    "mediaType": "carousel"
  },
  {
    "title": "Product thinking",
    "description": "Partner, not executor. Formulate hypotheses, connect design to metrics, bridge the gap between Figma and production. Run workshops with dev teams to ship what was designed.",
    "media": "/assets/images/product-thinking.jpg",
    "mediaType": "image"
  },
  {
    "title": "AI fluency",
    "description": "Use AI across the entire workflow: research, ideation, UX, visuals, prototyping, code. Deep understanding of infrastructure (models, RAG, APIs, MCPs).",
    "media": "/assets/images/AI fluency.jpg",
    "mediaType": "image"
  },
  {
    "title": "Design systems",
    "description": "Built design systems in Figma for Visa, RaceTrac, Amway, and more. Components, tokens, variables, documentation. Built foundations to scale across teams.",
    "media": "/assets/images/design-system.jpg",
    "mediaType": "image"
  },
  {
    "title": "AI prototyping and tools",
    "description": "Built complex workflows for task management, automation, and rapid prototyping. Always looking to integrate new tech into existing processes—from simple shortcuts to AI pipelines.",
    "media": "/assets/images/ai-prototyping.jpg",
    "mediaType": "image"
  },
  {
    "title": "Strong design foundations",
    "description": "Composition, typography, color, form — shaped by years in branding. Featured in Logolounge, Dieline, Packaging of the World. 500+k downloads of my font.",
    "media": "/assets/images/design-foundation.jpg",
    "mediaType": "image"
  },
  {
    "title": "Cross-functional collaboration",
    "description": "Worked closely with developers and product managers to ensure smooth implementation of design solutions. Facilitated design thinking workshops at major tech conferences.",
    "media": "/assets/images/cross functional.jpg",
    "mediaType": "image"
  },
  {
    "title": "Typography",
    "description": "Deep love for type. Created Peace Sans — 500K+ downloads. Typography is the foundation of everything I design.",
    "media": null,
    "mediaType": null
  },
  {
    "title": "Building apps & tools",
    "description": "Love creating internal tools that solve real problems. From task managers to prototyping apps — if it doesn't exist, I build it.",
    "media": null,
    "mediaType": null
  }
]