[
  {
    "title": "Introduction",
    "description": "Hi, my name is Sergey Ryadovoy. I'm a design leader with strong graphic design foundations and product thinking. 15 years in design and leadership—from branding and visual design to digital and AI products.",
    "tag": "Personal",
    "width": "regular",
    "media": "/assets/images/1-hello-rotation.gif",
    "mediaType": "image"
  },
  {
    "title": "Visa Website (2022–2025)",
    "description": "Directed Visa's digital rebranding rollout. I built the global design system in Figma, replacing our Sketch workflows so teams worldwide could ship consistent, accessible products faster. We created a ton of web pages and campaigns that established the new visual identity across digital. I also explored opportunities for what the site could become—ideas that are now reflected in the new website launching in 2026. We're continuing to work together on this.",
    "tag": "Project",
    "width": "wide",
    "media": "/assets/images/visa-showcase-2020-2024.mp4",
    "mediaType": "video"
  },
  {
    "title": "Digitas AI",
    "description": "For the past few years, I've been deeply involved in building AI tools. From developing modern design and management workflows in Claude Code to designing interfaces and working closely with developer teams. One of those projects is Digitas internal AI agentic platform that we're working on through 2025-2026.",
    "tag": "Project",
    "width": "regular",
    "media": "/assets/images/Animation-WebsiteAsset.gif",
    "mediaType": "image"
  },
  {
    "title": "UI/UX design",
    "description": "Led product design for Visa's global digital presence. Websites, apps, dashboards. Directed redesigns for Amway, RaceTrac, Delta Airlines.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/CleanShot 2026-01-23 at 12.20.51.gif",
    "mediaType": "image"
  },
  {
    "title": "Global brands",
    "description": "Throughout my career I worked a lot with global brands like Visa, Delta, Amway, Mondelez, L'oreal, RaceTrac, and more. I've designed and lead various of projects, from websites and apps to global campaigns.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/visa-cover-2.gif",
    "mediaType": "image"
  },
  {
    "title": "Amway Website",
    "description": "Directed the redesign of Amway's digital experience, from site architecture to components and visual design. Worked closely with their team to build a scalable design system that brought consistency across their global digital products.",
    "tag": "Project",
    "width": "wide",
    "media": "/assets/images/7-upload-1.gif",
    "mediaType": "image"
  },
  {
    "title": "Design systems",
    "description": "Built design systems for Visa, RaceTrac, Amway, and more. Components, tokens, variables, documentation — foundations that scale across teams.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/design-system.jpg",
    "mediaType": "image"
  },
  {
    "title": "AI workflows",
    "description": "Finding the bridge between design and AI and building the new design workflow. Claude Code, Cursor, Antigravity, MCP tools—using AI systematically across research, ideation, prototyping, designing and code.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/bridge.jpg",
    "mediaType": "image"
  },
  {
    "title": "Building tools",
    "description": "I love creating internal tools that solve real problems. From iOS apps and web applications to Figma plugins and Apple shortcuts that help with everyday tasks.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/CleanShot 2026-01-23 at 13.08.33@2x.png",
    "mediaType": "image"
  },
  {
    "title": "Public talks",
    "description": "During last few years I gave a few public talks sharing my findings and experiments into the AI field, showing some of the interesting ways to use AI for designers",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/the_magic_of_code.gif",
    "mediaType": "image"
  },
  {
    "title": "Mindcomplete",
    "description": "AI-powered writing assistant that completes your thoughts in real-time. Mindcomplete helps you write faster and more fluidly by predicting and suggesting how to continue your paragraphs. Simply pause while typing, and AI will suggest a natural continuation matching your tone and style. <a href='https://www.figma.com/community/plugin/1593731353807484611/mindcomplete' target='_blank'>Try it in Figma!</a>",
    "tag": "Experiment",
    "width": "wide",
    "media": "/assets/images/mindcomplete-hero-1.mp4",
    "mediaType": "video"
  },
  {
    "title": "Design base",
    "description": "Composition, typography, color, form — shaped by years in branding. Featured in Logolounge, Dieline, Packaging of the World.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/445351806_414975888023839_2041003039465379185_n.jpg",
    "mediaType": "image"
  },
  {
    "title": "Logo design",
    "description": "I've designed over 100 logos throughout my career, from startups to global brands. My logos have been printed on ships with containers, factories, store signs, and tons of merchandise and print productions all over the world.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/Image-590bb1b1-a148-4566-a6f2-eaa6aaca32be.gif",
    "mediaType": "image"
  },
  {
    "title": "Packaging design",
    "description": "Years of packaging design experience. Physical products, shelf presence, production constraints. Work featured in Dieline and Packaging of the World.",
    "tag": "Skill",
    "width": "regular",
    "media": [
      "/assets/images/1-FB-Elian-Cosmetics-00.webp",
      "/assets/images/10-final-w.webp",
      "/assets/images/8-image-6.jpg",
      "/assets/images/3-image-2.webp",
      "/assets/images/image-94c7bde8-39b3-4499-9bd7-078179309d51.jpg.webp",
      "/assets/images/image-b91beb23-3af2-4376-be93-0d7d491a16aa.jpg.webp"
    ],
    "mediaType": "carousel"
  },
  {
    "title": "Branding and identity design",
    "description": "Brand identity work across 15 years, from startups to federal brands. Logo systems, visual identities, brand guidelines. Foundation that shaped how I think about consistency and systems.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/Image-52a8929d-be08-4763-b53d-de6641f18e50.gif",
    "mediaType": "image"
  },
  {
    "title": "Typography",
    "description": "Deep love for type. Created Peace Sans — 500K+ downloads. Typography is the foundation of everything I design.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/peace-sans.jpg",
    "mediaType": "image"
  },
  {
    "title": "36 days of type",
    "description": "Created a font using just code in Openframeworks.",
    "tag": "Experiment",
    "width": "wide",
    "media": "/assets/images/1-36-days-of-type-project-card.gif",
    "mediaType": "image"
  },
  {
    "title": "California culture",
    "description": "Inspired by skate, surf, snowboard culture. Old skate magazine aesthetics, 80s California vibe — it's part of who I am.",
    "tag": "Personal",
    "width": "regular",
    "media": "/assets/images/CleanShot 2026-01-23 at 14.10.15@2x.png",
    "mediaType": "image"
  }
]