[
  {
    "title": "Introduction",
    "description": "Hi, my name is Sergey Ryadovoy. I'm a design leader with strong graphic design foundations and product thinking. 15 years in design and leadership—from branding and visual design to digital and AI products.",
    "tag": "Personal",
    "width": "regular",
    "media": "/assets/images/1-hello-rotation.gif",
    "mediaType": "image"
  },
  {
    "title": "Visa Website (2022–2025)",
    "description": "Directed Visa's digital rebranding rollout. I built the global design system in Figma, replacing our Sketch workflows so teams worldwide could ship consistent, accessible products faster. We created a ton of web pages and campaigns that established the new visual identity across digital. I also explored opportunities for what the site could become—ideas that are now reflected in the new website launching in 2026. We're continuing to work together on this.",
    "tag": "Project",
    "width": "wide",
    "media": "/assets/images/visa-showcase-2020-2024.mp4",
    "mediaType": "video"
  },
  {
    "title": "Digitas AI",
    "description": "For the past few years, I've been deeply involved in building AI tools. From developing modern design and management workflows in Claude Code to designing interfaces and working closely with developer teams. One of those projects is Digitas internal AI agentic platform that we're working on through 2025-2026. <a href='https://www.digitas.com/en-us/pressroom/digitas-unveils-new-generative-ai-platform-digitas-ai' target='_blank'>Learn more</a>",
    "tag": "Project",
    "width": "regular",
    "media": "/assets/images/Animation-WebsiteAsset.gif",
    "mediaType": "image"
  },
  {
    "title": "Global brands",
    "description": "Worked with many global brands across my career. Visa, Delta, Amway, Mondelez, L'Oreal, RaceTrac, and more. Everything from websites and apps to global campaigns. Every project taught me something new about working at scale.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/visa-cover-2.gif",
    "mediaType": "image"
  },
  {
    "title": "Product design",
    "description": "Led product design for Visa's global digital presence, directed redesigns for Amway, RaceTrac, Delta. Websites, apps, dashboards, design systems. Always thinking about both the visual and how things work together.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/CleanShot 2026-01-23 at 12.20.51.gif",
    "mediaType": "image"
  },
  {
    "title": "Amway Website",
    "description": "Directed the redesign of Amway's digital experience, from site architecture to components and visual design. Worked closely with their team to build a scalable design system that brought consistency across their global digital products.",
    "tag": "Project",
    "width": "wide",
    "media": "/assets/images/7-upload-1.gif",
    "mediaType": "image"
  },
  {
    "title": "Design systems",
    "description": "Built design systems for Visa, RaceTrac, Amway, and more. Components, tokens, variables, documentation. I love organizing, structuring, and making sure every small piece fits into the bigger picture.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/design-system.jpg",
    "mediaType": "image"
  },
  {
    "title": "AI workflows",
    "description": "Finding the bridge between design and AI and building the new design workflow. Claude Code, Cursor, Antigravity, MCP tools—using AI systematically across research, ideation, prototyping, designing and code.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/workflows.jpg",
    "mediaType": "image"
  },
  {
    "title": "Generative Media",
    "description": "I utilize a diverse stack of generative tools: Google Nano Banana Pro, Midjourney, Visual Electric, and Qwen for images; Kling, Wan, and Sora for video. My workflows range from consumer-facing apps like Higgsfield to building advanced, custom pipelines in ComfyUI and Weavy.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/copy_170C990E-007D-4414-9C0C-082100A8D690.mp4",
    "mediaType": "video"
  },
  {
    "title": "AI Prototyping",
    "description": "From detailed prototypes in Figma to quick iterations with Antigravity and Claude Code. I always look for ways to make quick prototypes that help teams make decisions faster, especially when working with larger groups.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/bridge.jpg",
    "mediaType": "image"
  },
  {
    "title": "Conversational AI",
    "description": "Since the advent of transformers, text has become the primary interface for intelligent systems. I design and build conversational interfaces that handle the nuances of LLMs—from context management to latency patterns. My work bridges the gap between human intent and model capabilities, creating natural, effective, and human-centric AI experiences.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/visa-liquid-ui.jpg",
    "mediaType": "image"
  },
  {
    "title": "Mindcomplete",
    "description": "AI-powered writing assistant that completes your thoughts in real-time. Mindcomplete helps you write faster and more fluidly by predicting and suggesting how to continue your paragraphs. Simply pause while typing, and AI will suggest a natural continuation matching your tone and style. Try it in Figma!",
    "tag": "Experiment",
    "width": "wide",
    "media": "/assets/images/mindcomplete-hero-1.mp4",
    "mediaType": "video"
  },
  {
    "title": "Foundations",
    "description": "Strong foundation in composition, typography, color, and form. All of this comes from years in branding and visual design. Featured in Logolounge, Dieline, Packaging of the World.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/445351806_414975888023839_2041003039465379185_n.jpg",
    "mediaType": "image"
  },
  {
    "title": "Packaging design",
    "description": "Packaging taught me to think about the physical world. Materials, production, how things look on a shelf. Work featured in Dieline and Packaging of the World.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/upload-1766444315366-4.webp",
    "mediaType": "image"
  },
  {
    "title": "Motion design",
    "description": "Figma prototyping tools for quick motion examples, After Effects and Cavalry for complex motion assets. I love working with motion and always keep my skills up to date.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/Apr-21-2022 08-45-01.gif",
    "mediaType": "image"
  },
  {
    "title": "Journely",
    "description": "What if conversational UI wasn't about typing, but writing? I created Journely as an experiment to find natural ways to use AI in everyday life. It transforms journaling on iPad by blending handwriting with conversational intelligence. <a href='https://apps.apple.com/us/app/journely/id6744461713' target='_blank'>Download on iPad</a>",
    "tag": "Project",
    "width": "wide",
    "media": "/assets/images/journely.jpg",
    "mediaType": "image"
  },
  {
    "title": "Public talks",
    "description": "I've given several public talks about AI and design. Sharing experiments, tools, and interesting ways designers can use AI in their work.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/the_magic_of_code.gif",
    "mediaType": "image"
  },
  {
    "title": "Logo design",
    "description": "I've designed over 100 logos throughout my career, from startups to global brands. My logos have been printed on ships with containers, factories, store signs, and tons of merchandise and print productions all over the world.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/Image-590bb1b1-a148-4566-a6f2-eaa6aaca32be.gif",
    "mediaType": "image"
  },
  {
    "title": "Branding and identity design",
    "description": "Brand identity work across 15 years, from startups to federal brands. Logo systems, visual identities, brand guidelines. Foundation that shaped how I think about consistency and systems.",
    "tag": "Skill",
    "width": "regular",
    "media": "/assets/images/3-video-1.mp4",
    "mediaType": "video"
  },
  {
    "title": "Peace Sans Free Font",
    "description": "Peace Sans is a free display font I designed. It reached 500K+ downloads and became one of the most popular free fonts on Behance. I wanted to give something back to the design community. <a href='/assets/Peace Sans.zip' download>Download Peace Sans</a>",
    "tag": "Project",
    "width": "regular",
    "media": "/assets/images/peace-sans.jpg",
    "mediaType": "image"
  },
  {
    "title": "36 days of type",
    "description": "A creative coding exploration for 36 Days of Type. Every letter was animated solely through OpenFrameworks and AI, blending algorithmic logic with artificial intelligence.",
    "tag": "Experiment",
    "width": "wide",
    "media": "/assets/images/1-36-days-of-type-project-card.gif",
    "mediaType": "image"
  },
  {
    "title": "Building tools",
    "description": "I love creating internal tools that solve real problems. From iOS apps and web applications to Figma plugins and Apple shortcuts that help with everyday tasks.",
    "tag": "Experience",
    "width": "regular",
    "media": "/assets/images/apps.jpg",
    "mediaType": "image"
  }
]